@echo off
chcp 65001 > nul
title Бот Записи Клиентов (НЕ ЗАКРЫВАТЬ)
color 0B

echo ==========================================
echo        ЗАПУСК БОТА...
echo ==========================================
echo.

:: Проверка, есть ли папка venv
if not exist venv (
    color 0C
    echo ОШИБКА: Виртуальное окружение не найдено!
    echo Сначала запустите файл install.bat
    pause
    exit
)

call venv\Scripts\activate

:: Запуск модуля
python -m bot.main

:: Если бот упал с ошибкой, окно не закроется сразу
echo.
echo ==========================================
echo    БОТ ОСТАНОВИЛСЯ.
echo ==========================================
pause